
# player.추가피해_합_고블린 -= self.추가피해_합_고블린
# player.추가피해_합_오크 -= self.추가피해_합_오크
# player.추가피해_합_스켈레톤 -= self.추가피해_합_스켈레톤
# player.추가피해_합_좀비 -= self.추가피해_합_좀비
# player.추가피해_합_야수 -= self.추가피해_합_야수
# player.추가피해_합_벌레 -= self.추가피해_합_벌레
# player.추가피해_합_정령 -= self.추가피해_합_정령
# player.추가피해_합_악마 -= self.추가피해_합_악마
# player.추가피해_합_천사 -= self.추가피해_합_천사
# player.추가피해_합_식물 -= self.추가피해_합_식물
# player.추가피해_합_무형 -= self.추가피해_합_무형
# player.추가피해_합_기계 -= self.추가피해_합_기계
import random

class Monster():
    def __init__(self, 이름:str, 종족:str, 체력:int, 마력:int, 공격력:int, 힘:int, 민첩:int, 지능:int, 운:int, 스피드:int, 
                 회피율:float, 방어력:int, 물리저항:float, 화염저항:float, 냉기저항:float, 독저항:float, 전기저항:float, 암흑저항:float, 신성저항:float,
                 경험치:int, 골드:int, 스킬:list, 아이템:list):
        self.이름 = 이름
        self.종족 = 종족
        self.체력 = 체력
        self.최대체력 = 체력
        self.마력 = 마력
        self.최대마력 = 마력
        self.공격력 = 공격력
        self.힘 = 힘
        self.민첩 = 민첩
        self.지능 = 지능
        self.운 = 운
        self.스피드 = 스피드
        self.회피율 = 회피율
        self.방어력 = 방어력
        self.물리저항 = 물리저항
        self.화염저항 = 화염저항
        self.냉기저항 = 냉기저항
        self.독저항 = 독저항
        self.전기저항 = 전기저항
        self.암흑저항 = 암흑저항
        self.신성저항 = 신성저항
        self.경험치 = 경험치
        self.골드 = 골드
        self.스킬 = 스킬
        self.아이템 = 아이템
        

    def 죽음판정(self):
        if self.체력 <= 0:
            return True
        else:
            return False
    
    def 피해받음(self, 피해량):
        self.체력 -= 피해량
        
    def 회복(self, 회복량):
        self.체력 += 회복량
        if self.체력 > self.최대체력:
            self.체력 = self.최대체력
            
def monster_gen(name, 배율=1):
    if name == '그린 고블린':
        return Monster('그린 고블린', '고블린', int(40*배율), 0, int(6*배율), int(5*배율), int(9*배율), int(5*배율), int(3*배율), int(5*배율), 0.0, int(1*배율), 
                       0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 3, 3, ['할퀴기', '칼질'], [['단검', 50], ['천두건', 19], ['천갑옷', 19], ['천바지', 19], ['신발', 19]])
    elif name == '레드 고블린':
        return Monster('레드 고블린', '고블린', int(50*배율), 0, int(9*배율), int(6*배율), int(10*배율), int(5*배율), int(3*배율), int(5*배율), 0.0, int(1*배율), 
                       0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 5, 5, ['할퀴기', '칼질'], [['단검', 20], ['롱소드', 15], ['사과', 30], ['바나나', 30]])
    elif name == '뱀':
        return Monster('뱀', '야수', int(38*배율), 0, int(12*배율), int(4*배율), int(12*배율), int(4*배율), int(6*배율), int(5*배율), 4.0, int(1*배율), 
                       0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 4, random.randint(2, 5), ['물기'], [['채찍', 12], ['단검', 7], ['롱소드', 17.5], ['사과', 7], ['바나나', 7], ['의식용 단검', 10], ['아도겐 학습서', 5.5]])
    elif name == '독사':
        return Monster('독사', '야수', int(50*배율), 0, int(15*배율), int(4*배율), int(16*배율), int(6*배율), int(4*배율), int(7*배율), 5.0, int(1*배율), 
                       0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, random.randint(3, 7), random.randint(2, 5), ['물기', '독니'], 
                       [['뱀독', 30], ['롱소드', 20], ['천두건', 5], ['천갑옷', 5], ['천바지', 5], ['천신발', 5], ['독사의 눈물', 1.5], ['마법부여:죽음의 고통', 1.5]])
    elif name == '일반 좀비':
        return Monster('일반 좀비', '좀비', int(70*배율), 0, int(18*배율), int(9*배율), int(8*배율), int(3*배율), int(2*배율), int(5*배율), 1.0, int(2*배율), 
                       0.0, 0.0, 0.0, 10.0, 0.0, 10.0, 0.0, random.randint(5, 10), random.randint(3, 8), ['물기', '할퀴기', '할퀴기', '독니'], 
                       [['가죽 자켓', 17], ['롱소드', 20], ['천두건', 5], ['천갑옷', 5], ['천바지', 5], ['천신발', 5], ['마법부여:죽음의 고통', 4], ['채찍', 14]])
    elif name == '화이트 스켈레톤':
        return Monster('화이트 스켈레톤', '스켈레톤', int(57*배율), 0, int(19*배율), int(11*배율), int(9*배율), int(10*배율), int(4*배율), int(5*배율), 1.0, int(0*배율),
                       0.0, -20.0, 0.0, 80.0, 0.0, 0.0, 0.0, random.randint(6, 9), random.randint(1, 7), ['할퀴기', '할퀴기', '칼질', '칼질', '칼질'], 
                       [['구두', 20], ['마법부여:죽음의 고통', 1], ['채찍', 18], ['바나나', 40], ['본 아머', 3]])
    elif name == '사자':
        return Monster('사자', '야수', int(150*배율), 0, int(30*배율), int(25*배율), int(20*배율), int(15*배율), int(10*배율), int(11*배율), 6.0, int(5*배율),
                       0.0, -20.0, 0.0, 80.0, 0.0, 0.0, 0.0, random.randint(20, 30), random.randint(8, 25), ['할퀴기', '물기'], 
                       [['가죽 자켓', 25], ['마법부여:밀림의 왕', 6], ['마법부여:강인', 5], ['마법부여:공포', 1.5], ['본 아머', 2.6], ['채찍', 13], ['디스코 바지', 11]])