
import time
import nplayer
from PyQt5 import QtCore

# 마부_합_최대체력
# 마부_곱_최대체력
# 마부_합_최대마력
# 마부_곱_최대마력
# 마부_합_공격력
# 마부_곱_공격력
# 마부_합_힘
# 마부_곱_힘
# 마부_합_민첩
# 마부_곱_민첩
# 마부_합_지능
# 마부_곱_지능
# 마부_합_운
# 마부_곱_운
# 마부_합_스피드
# 마부_곱_스피드
# 마부_합_회피율
# 마부_합_방어력
# 마부_곱_방어력
# 마부_합_물리저항
# 마부_합_화염저항
# 마부_합_냉기저항
# 마부_합_독저항
# 마부_합_전기저항
# 마부_합_암흑저항
# 마부_합_신성저항

def reset(mes):
    loop = QtCore.QEventLoop()
    QtCore.QTimer.singleShot(mes, loop.quit)
    loop.exec_()

def 마법부여(item, 주문서, mainWin):
    if item.장착됨 == True:
        mainWin.TB_main.append('마법 부여는 장착된 아이템에는 할 수 없습니다.')
        reset(1000)
        return
    else:
        mainWin.TB_main.append('{} 마법부여가 완료 되었습니다 !!'.format(주문서.이름))
        reset(1500)
        item.마부초기화()
        item.마부_텍스트 = ''
        item.마부_합_최대체력 += 주문서.마부_합_최대체력
        item.마부_곱_최대체력 += 주문서.마부_곱_최대체력
        item.마부_합_최대마력 += 주문서.마부_합_최대마력
        item.마부_곱_최대마력 += 주문서.마부_곱_최대마력
        item.마부_합_공격력 += 주문서.마부_합_공격력
        item.마부_곱_공격력 += 주문서.마부_곱_공격력
        item.마부_합_힘 += 주문서.마부_합_힘
        item.마부_곱_힘 += 주문서.마부_곱_힘
        item.마부_합_민첩 += 주문서.마부_합_민첩
        item.마부_곱_민첩 += 주문서.마부_곱_민첩
        item.마부_합_지능 += 주문서.마부_합_지능
        item.마부_곱_지능 += 주문서.마부_곱_지능
        item.마부_합_운 += 주문서.마부_합_운
        item.마부_곱_운 += 주문서.마부_곱_운
        item.마부_합_스피드 += 주문서.마부_합_스피드
        item.마부_곱_스피드 += 주문서.마부_곱_스피드
        item.마부_합_회피율 += 주문서.마부_합_회피율
        item.마부_합_방어력 += 주문서.마부_합_방어력
        item.마부_곱_방어력 += 주문서.마부_곱_방어력
        item.마부_합_물리저항 += 주문서.마부_합_물리저항
        item.마부_합_화염저항 += 주문서.마부_합_화염저항
        item.마부_합_냉기저항 += 주문서.마부_합_냉기저항
        item.마부_합_독저항 += 주문서.마부_합_독저항
        item.마부_합_전기저항 += 주문서.마부_합_전기저항
        item.마부_합_암흑저항 += 주문서.마부_합_암흑저항
        item.마부_합_신성저항 += 주문서.마부_합_신성저항
        
        item.마부_텍스트 += '\n ==< ' + 주문서.이름 + ' >== \n' + 주문서.상세정보
        
        return
    
        
        
class 아이템:
    def __init__(self, 이름:str, 종류:str, 설명:str, 상세정보:str, 구매가:int, 판매가:int, iid:int):
        self. 이름 = 이름
        self.종류 = 종류
        self.설명 = 설명
        self.상세정보 = 상세정보
        self.구매가 = 구매가
        self.판매가 = 판매가
        self.iid = iid
       
class 아이템_소비(아이템):
    def __init__(self, 이름: str, 설명: str, 상세정보: str, 구매가: int, 판매가: int, iid:int,
                 효과_체력회복:int=0, 효과_마력회복:int=0,
                 효과_고유스탯증가_최대체력:int=0,
                 효과_고유스탯증가_최대마력:int=0,
                 효과_고유스탯증가_공격력:int=0,
                 효과_고유스탯증가_힘:int=0,
                 효과_고유스탯증가_민첩:int=0,
                 효과_고유스탯증가_지능:int=0,
                 효과_고유스탯증가_운:int=0,
                 효과_고유스탯증가_스피드:int=0,
                 효과_고유스탯증가_회피율:int=0,
                 효과_고유스탯증가_방어력:int=0,
                 효과_고유스탯증가_물리저항:int=0,
                 효과_고유스탯증가_화염저항:int=0,
                 효과_고유스탯증가_냉기저항:int=0,
                 효과_고유스탯증가_독저항:int=0,
                 효과_고유스탯증가_전기저항:int=0,
                 효과_고유스탯증가_암흑저항:int=0,
                 효과_고유스탯증가_신성저항:int=0,
                 효과_고유_추가피해_고블린:float = 0.0,
                 효과_고유_추가피해_오크:float = 0.0,
                 효과_고유_추가피해_스켈레톤:float = 0.0,
                 효과_고유_추가피해_좀비:float = 0.0,
                 효과_고유_추가피해_야수:float = 0.0,
                 효과_고유_추가피해_벌레:float = 0.0,
                 효과_고유_추가피해_기계:float = 0.0,
                 효과_고유_추가피해_무형:float = 0.0,
                 효과_고유_추가피해_정령:float = 0.0,
                 효과_고유_추가피해_악마:float = 0.0,
                 효과_고유_추가피해_천사:float = 0.0,
                 효과_고유_추가피해_식물:float = 0.0,
                 효과_피해받음:int = 0,
                 효과_스킬습득:str=''):
        super().__init__(이름, '소비', 설명, 상세정보, 구매가, 판매가, iid)
        self.효과_체력회복:int=효과_체력회복
        self.효과_마력회복:int=효과_마력회복
        self.효과_고유스탯증가_최대체력:int=효과_고유스탯증가_최대체력
        self.효과_고유스탯증가_최대마력:int=효과_고유스탯증가_최대마력
        self.효과_고유스탯증가_공격력:int=효과_고유스탯증가_공격력
        self.효과_고유스탯증가_힘:int=효과_고유스탯증가_힘
        self.효과_고유스탯증가_민첩:int=효과_고유스탯증가_민첩
        self.효과_고유스탯증가_지능:int=효과_고유스탯증가_지능
        self.효과_고유스탯증가_운:int=효과_고유스탯증가_운
        self.효과_고유스탯증가_스피드:int=효과_고유스탯증가_스피드
        self.효과_고유스탯증가_회피율:int=효과_고유스탯증가_회피율
        self.효과_고유스탯증가_방어력:int=효과_고유스탯증가_방어력
        self.효과_고유스탯증가_물리저항:int=효과_고유스탯증가_물리저항
        self.효과_고유스탯증가_화염저항:int=효과_고유스탯증가_화염저항
        self.효과_고유스탯증가_냉기저항:int=효과_고유스탯증가_냉기저항
        self.효과_고유스탯증가_독저항:int=효과_고유스탯증가_독저항
        self.효과_고유스탯증가_전기저항:int=효과_고유스탯증가_전기저항
        self.효과_고유스탯증가_암흑저항:int=효과_고유스탯증가_암흑저항
        self.효과_고유스탯증가_신성저항:int=효과_고유스탯증가_신성저항
        self.효과_고유_추가피해_고블린:float = 효과_고유_추가피해_고블린
        self.효과_고유_추가피해_오크:float = 효과_고유_추가피해_오크
        self.효과_고유_추가피해_스켈레톤:float = 효과_고유_추가피해_스켈레톤
        self.효과_고유_추가피해_좀비:float = 효과_고유_추가피해_좀비
        self.효과_고유_추가피해_야수:float = 효과_고유_추가피해_야수
        self.효과_고유_추가피해_벌레:float = 효과_고유_추가피해_벌레
        self.효과_고유_추가피해_기계:float = 효과_고유_추가피해_기계
        self.효과_고유_추가피해_무형:float = 효과_고유_추가피해_무형
        self.효과_고유_추가피해_정령:float = 효과_고유_추가피해_정령
        self.효과_고유_추가피해_악마:float = 효과_고유_추가피해_악마
        self.효과_고유_추가피해_천사:float = 효과_고유_추가피해_천사
        self.효과_고유_추가피해_식물:float = 효과_고유_추가피해_식물
        self.효과_피해받음:int = 효과_피해받음
        self.효과_스킬습득:str = 효과_스킬습득
    
    def 사용(self, player, mainWin):
        사용결과 = True
        
        if player.체력 < self.효과_피해받음:
            mainWin.TB_main.append('체력이 적어 사용할 수 없습니다.')
            reset(900)
            return False
        
        mainWin.TB_main.append('{} 을(를) 사용했습니다.'.format(self.이름))
        
        player.고유_최대체력 += self.효과_고유스탯증가_최대체력
        player.고유_최대마력 += self.효과_고유스탯증가_최대마력
        player.고유_공격력 += self.효과_고유스탯증가_공격력
        player.고유_힘 += self.효과_고유스탯증가_힘
        player.고유_민첩 += self.효과_고유스탯증가_민첩
        player.고유_지능 += self.효과_고유스탯증가_지능
        player.고유_운 += self.효과_고유스탯증가_운
        player.고유_스피드 += self.효과_고유스탯증가_스피드
        player.고유_회피율 += self.효과_고유스탯증가_회피율
        player.고유_방어력 += self.효과_고유스탯증가_방어력
        player.고유_물리저항 += self.효과_고유스탯증가_물리저항
        player.고유_화염저항 += self.효과_고유스탯증가_화염저항
        player.고유_냉기저항 += self.효과_고유스탯증가_냉기저항
        player.고유_독저항 += self.효과_고유스탯증가_독저항
        player.고유_전기저항 += self.효과_고유스탯증가_전기저항
        player.고유_암흑저항 += self.효과_고유스탯증가_암흑저항
        player.고유_신성저항 += self.효과_고유스탯증가_신성저항
        player.고유_추가피해_고블린 += self.효과_고유_추가피해_고블린
        player.고유_추가피해_오크 += self.효과_고유_추가피해_오크
        player.고유_추가피해_스켈레톤 += self.효과_고유_추가피해_스켈레톤
        player.고유_추가피해_좀비 += self.효과_고유_추가피해_좀비
        player.고유_추가피해_야수 += self.효과_고유_추가피해_야수
        player.고유_추가피해_벌레 += self.효과_고유_추가피해_벌레
        player.고유_추가피해_기계 += self.효과_고유_추가피해_기계
        player.고유_추가피해_무형 += self.효과_고유_추가피해_무형
        player.고유_추가피해_정령 += self.효과_고유_추가피해_정령
        player.고유_추가피해_악마 += self.효과_고유_추가피해_악마
        player.고유_추가피해_천사 += self.효과_고유_추가피해_천사
        player.고유_추가피해_식물 += self.효과_고유_추가피해_식물
        
        if player.고유_회피율 > 50:
            player.고유_회피율 = 50
        if player.고유_물리저항 > 50:
            player.고유_물리저항 = 50
        if player.고유_화염저항 > 50:
            player.고유_화염저항 = 50
        if player.고유_냉기저항 > 50:
            player.고유_냉기저항 = 50
        if player.고유_독저항 > 50:
            player.고유_독저항 = 50
        if player.고유_전기저항 > 50:
            player.고유_전기저항 = 50
        if player.고유_암흑저항 > 50:
            player.고유_암흑저항 = 50
        if player.고유_신성저항 > 50:
            player.고유_신성저항 = 50
        
        player.스탯새로고침()
        
        player.체력 -= self.효과_피해받음
        player.체력 += self.효과_체력회복
        player.마력 += self.효과_마력회복
        
        if player.체력 > player.최대체력:
            player.체력 = player.최대체력
        if player.마력 > player.최대마력:
            player.마력 = player.최대마력
            
        if self.효과_스킬습득 != '':
            if self.효과_스킬습득 not in player.스킬들:
                player.스킬들.append(self.효과_스킬습득)
                mainWin.TB_main.append('스킬: [{}] 을(를) 학습했습니다.'.format(self.효과_스킬습득))
            else:
                mainWin.TB_main.append('이미 [{}] 을(를) 배우고 있습니다...')
                사용결과 = False
            time.sleep(1.5)
                
        
        return 사용결과
        
### 부위
# 머리
# 상의
# 하의
# 신발
# 무기
# 보조장비

class 아이템_장비(아이템):
    장착됨 = False
    
    마부_합_최대체력:int = 0
    마부_곱_최대체력:int = 0
    마부_합_최대마력:int = 0
    마부_곱_최대마력:int = 0
    마부_합_공격력:int = 0
    마부_곱_공격력:int = 0
    마부_합_힘:int = 0
    마부_곱_힘:int = 0
    마부_합_민첩:int = 0
    마부_곱_민첩:int = 0
    마부_합_지능:int = 0
    마부_곱_지능:int = 0
    마부_합_운:int = 0
    마부_곱_운:int = 0
    마부_합_스피드:int = 0
    마부_곱_스피드:int = 0
    마부_합_회피율:float = 0.0
    마부_합_방어력:int = 0
    마부_곱_방어력:int = 0
    마부_합_물리저항:float = 0.0
    마부_합_화염저항:float = 0.0
    마부_합_냉기저항:float = 0.0
    마부_합_독저항:float = 0.0
    마부_합_전기저항:float = 0.0
    마부_합_암흑저항:float = 0.0
    마부_합_신성저항:float = 0.0
    
    def __init__(self, 이름: str, 설명: str, 상세정보: str, 구매가: int, 판매가: int, iid:int, 
                 부위:str,
                 스탯증가_합_최대체력:int = 0, 스탯증가_곱_최대체력:int = 0,
                 스탯증가_합_최대마력:int = 0, 스탯증가_곱_최대마력:int = 0,
                 스탯증가_합_공격력:int = 0, 스탯증가_곱_공격력:int = 0,
                 스탯증가_합_힘:int = 0, 스탯증가_곱_힘:int = 0,
                 스탯증가_합_민첩:int = 0, 스탯증가_곱_민첩:int = 0,
                 스탯증가_합_지능:int = 0, 스탯증가_곱_지능:int = 0,
                 스탯증가_합_운:int = 0, 스탯증가_곱_운:int = 0,
                 스탯증가_합_스피드:int = 0, 스탯증가_곱_스피드:int = 0,
                 스탯증가_합_회피율:float = 0.0, 스탯증가_합_방어력:int = 0, 스탯증가_곱_방어력:int = 0,
                 스탯증가_합_물리저항:float = 0.0,
                 스탯증가_합_화염저항:float = 0.0,
                 스탯증가_합_냉기저항:float = 0.0,
                 스탯증가_합_독저항:float = 0.0,
                 스탯증가_합_전기저항:float = 0.0,
                 스탯증가_합_암흑저항:float = 0.0,
                 스탯증가_합_신성저항:float = 0.0,
                 추가피해_합_고블린:float = 0.0,
                 추가피해_합_오크:float = 0.0,
                 추가피해_합_스켈레톤:float = 0.0,
                 추가피해_합_좀비:float = 0.0,
                 추가피해_합_야수:float = 0.0,
                 추가피해_합_벌레:float = 0.0,
                 추가피해_합_기계:float = 0.0,
                 추가피해_합_무형:float = 0.0,
                 추가피해_합_정령:float = 0.0,
                 추가피해_합_악마:float = 0.0,
                 추가피해_합_천사:float = 0.0,
                 추가피해_합_식물:float = 0.0,
                 장착시_스킬:str = '-',
                 마부_텍스트:str = ''):
        super().__init__(이름, '장비', 설명, 상세정보, 구매가, 판매가, iid)
        self.부위:str = 부위
        self.스탯증가_합_최대체력:int = 스탯증가_합_최대체력
        self.스탯증가_곱_최대체력:int = 스탯증가_곱_최대체력
        self.스탯증가_합_최대마력:int = 스탯증가_합_최대마력
        self.스탯증가_곱_최대마력:int = 스탯증가_곱_최대마력
        self.스탯증가_합_공격력:int = 스탯증가_합_공격력
        self.스탯증가_곱_공격력:int = 스탯증가_곱_공격력
        self.스탯증가_합_힘:int = 스탯증가_합_힘
        self.스탯증가_곱_힘:int = 스탯증가_곱_힘
        self.스탯증가_합_민첩:int = 스탯증가_합_민첩
        self.스탯증가_곱_민첩:int = 스탯증가_곱_민첩
        self.스탯증가_합_지능:int = 스탯증가_합_지능
        self.스탯증가_곱_지능:int = 스탯증가_곱_지능
        self.스탯증가_합_운:int = 스탯증가_합_운
        self.스탯증가_곱_운:int = 스탯증가_곱_운
        self.스탯증가_합_스피드:int = 스탯증가_합_스피드
        self.스탯증가_곱_스피드:int = 스탯증가_곱_스피드
        self.스탯증가_합_회피율:float = 스탯증가_합_회피율
        self.스탯증가_합_방어력:int = 스탯증가_합_방어력
        self.스탯증가_곱_방어력:int = 스탯증가_곱_방어력
        self.스탯증가_합_물리저항:float = 스탯증가_합_물리저항
        self.스탯증가_합_화염저항:float = 스탯증가_합_화염저항
        self.스탯증가_합_냉기저항:float = 스탯증가_합_냉기저항
        self.스탯증가_합_독저항:float = 스탯증가_합_독저항
        self.스탯증가_합_전기저항:float = 스탯증가_합_전기저항
        self.스탯증가_합_암흑저항:float = 스탯증가_합_암흑저항
        self.스탯증가_합_신성저항:float = 스탯증가_합_신성저항
        self.추가피해_합_고블린:float = 추가피해_합_고블린
        self.추가피해_합_오크:float = 추가피해_합_오크
        self.추가피해_합_스켈레톤:float = 추가피해_합_스켈레톤
        self.추가피해_합_좀비:float = 추가피해_합_좀비
        self.추가피해_합_야수:float = 추가피해_합_야수
        self.추가피해_합_벌레:float = 추가피해_합_벌레
        self.추가피해_합_정령:float = 추가피해_합_정령
        self.추가피해_합_악마:float = 추가피해_합_악마
        self.추가피해_합_천사:float = 추가피해_합_천사
        self.추가피해_합_식물:float = 추가피해_합_식물
        self.추가피해_합_무형:float = 추가피해_합_무형
        self.추가피해_합_기계:float = 추가피해_합_기계
        self.장착시_스킬 = 장착시_스킬
        self.마부_텍스트 = 마부_텍스트
    
    def 장착(self, player):
        
        if self.장착됨 == False:
            
            if getattr(player, '장비칸_' + self.부위) == '-':
                setattr(player, '장비칸_' + self.부위, self.iid)
            else:
                for i in player.인벤토리:
                    if getattr(player, '장비칸_' + self.부위) == i.iid:
                        i.장착해제(player)
                        setattr(player, '장비칸_' + self.부위, self.iid)
                
            print(self.이름 + ' 장착완료')
            self.장착됨 = True
            
            if self.장착시_스킬 != '-':
                player.스킬들.append(self.장착시_스킬)
                
            
            
            player.스탯증가_합_최대체력 += self.스탯증가_합_최대체력
            player.스탯증가_곱_최대체력 += self.스탯증가_곱_최대체력
            player.스탯증가_합_최대마력 += self.스탯증가_합_최대마력
            player.스탯증가_곱_최대마력 += self.스탯증가_곱_최대마력
            player.스탯증가_합_공격력 += self.스탯증가_합_공격력
            player.스탯증가_곱_공격력 += self.스탯증가_곱_공격력
            
            player.스탯증가_합_힘 += self.스탯증가_합_힘
            player.스탯증가_곱_힘 += self.스탯증가_곱_힘
            player.스탯증가_합_민첩 += self.스탯증가_합_민첩
            player.스탯증가_곱_민첩 += self.스탯증가_곱_민첩
            player.스탯증가_합_지능 += self.스탯증가_합_지능
            player.스탯증가_곱_지능 += self.스탯증가_곱_지능
            player.스탯증가_합_운 += self.스탯증가_합_운
            player.스탯증가_곱_운 += self.스탯증가_곱_운
            player.스탯증가_합_스피드 += self.스탯증가_합_스피드
            player.스탯증가_곱_스피드 += self.스탯증가_곱_스피드
            
            player.스탯증가_합_회피율 += self.스탯증가_합_회피율
            player.스탯증가_합_방어력 += self.스탯증가_합_방어력
            player.스탯증가_곱_방어력 += self.스탯증가_곱_방어력
            
            player.스탯증가_합_물리저항 += self.스탯증가_합_물리저항
            player.스탯증가_합_화염저항 += self.스탯증가_합_화염저항
            player.스탯증가_합_냉기저항 += self.스탯증가_합_냉기저항
            player.스탯증가_합_독저항 += self.스탯증가_합_독저항
            player.스탯증가_합_전기저항 += self.스탯증가_합_전기저항
            player.스탯증가_합_암흑저항 += self.스탯증가_합_암흑저항
            player.스탯증가_합_신성저항 += self.스탯증가_합_신성저항
            
            player.추가피해_합_고블린 += self.추가피해_합_고블린
            player.추가피해_합_오크 += self.추가피해_합_오크
            player.추가피해_합_스켈레톤 += self.추가피해_합_스켈레톤
            player.추가피해_합_좀비 += self.추가피해_합_좀비
            player.추가피해_합_야수 += self.추가피해_합_야수
            player.추가피해_합_벌레 += self.추가피해_합_벌레
            player.추가피해_합_정령 += self.추가피해_합_정령
            player.추가피해_합_악마 += self.추가피해_합_악마
            player.추가피해_합_천사 += self.추가피해_합_천사
            player.추가피해_합_식물 += self.추가피해_합_식물
            player.추가피해_합_무형 += self.추가피해_합_무형
            player.추가피해_합_기계 += self.추가피해_합_기계
            
            # 마부
            player.스탯증가_합_최대체력 += self.마부_합_최대체력
            player.스탯증가_곱_최대체력 += self.마부_곱_최대체력
            player.스탯증가_합_최대마력 += self.마부_합_최대마력
            player.스탯증가_곱_최대마력 += self.마부_곱_최대마력
            player.스탯증가_합_공격력 += self.마부_합_공격력
            player.스탯증가_곱_공격력 += self.마부_곱_공격력
            
            player.스탯증가_합_힘 += self.마부_합_힘
            player.스탯증가_곱_힘 += self.마부_곱_힘
            player.스탯증가_합_민첩 += self.마부_합_민첩
            player.스탯증가_곱_민첩 += self.마부_곱_민첩
            player.스탯증가_합_지능 += self.마부_합_지능
            player.스탯증가_곱_지능 += self.마부_곱_지능
            player.스탯증가_합_운 += self.마부_합_운
            player.스탯증가_곱_운 += self.마부_곱_운
            player.스탯증가_합_스피드 += self.마부_합_스피드
            player.스탯증가_곱_스피드 += self.마부_곱_스피드
            
            player.스탯증가_합_회피율 += self.마부_합_회피율
            player.스탯증가_합_방어력 += self.마부_합_방어력
            player.스탯증가_곱_방어력 += self.마부_곱_방어력
            
            player.스탯증가_합_물리저항 += self.마부_합_물리저항
            player.스탯증가_합_화염저항 += self.마부_합_화염저항
            player.스탯증가_합_냉기저항 += self.마부_합_냉기저항
            player.스탯증가_합_독저항 += self.마부_합_독저항
            player.스탯증가_합_전기저항 += self.마부_합_전기저항
            player.스탯증가_합_암흑저항 += self.마부_합_암흑저항
            player.스탯증가_합_신성저항 += self.마부_합_신성저항
            
            player.스탯새로고침()
            
            return True
        
        else:
            print(self.이름 + ' 장착실패')
            return False
        
    def 장착해제(self, player):
        if self.장착됨:
        
            self.장착됨 = False
            
            print(self.이름 + ' 해제완료')
            
            setattr(player, '장비칸_' + self.부위, '-')

        
            if self.장착시_스킬 != '-':
                player.스킬들.remove(self.장착시_스킬)
                
            player.스탯증가_합_최대체력 -= self.스탯증가_합_최대체력
            player.스탯증가_곱_최대체력 -= self.스탯증가_곱_최대체력
            player.스탯증가_합_최대마력 -= self.스탯증가_합_최대마력
            player.스탯증가_곱_최대마력 -= self.스탯증가_곱_최대마력
            player.스탯증가_합_공격력 -= self.스탯증가_합_공격력
            player.스탯증가_곱_공격력 -= self.스탯증가_곱_공격력
            
            player.스탯증가_합_힘 -= self.스탯증가_합_힘
            player.스탯증가_곱_힘 -= self.스탯증가_곱_힘
            player.스탯증가_합_민첩 -= self.스탯증가_합_민첩
            player.스탯증가_곱_민첩 -= self.스탯증가_곱_민첩
            player.스탯증가_합_지능 -= self.스탯증가_합_지능
            player.스탯증가_곱_지능 -= self.스탯증가_곱_지능
            player.스탯증가_합_운 -= self.스탯증가_합_운
            player.스탯증가_곱_운 -= self.스탯증가_곱_운
            player.스탯증가_합_스피드 -= self.스탯증가_합_스피드
            player.스탯증가_곱_스피드 -= self.스탯증가_곱_스피드
            
            player.스탯증가_합_회피율 -= self.스탯증가_합_회피율
            player.스탯증가_합_방어력 -= self.스탯증가_합_방어력
            player.스탯증가_곱_방어력 -= self.스탯증가_곱_방어력
            
            player.스탯증가_합_물리저항 -= self.스탯증가_합_물리저항
            player.스탯증가_합_화염저항 -= self.스탯증가_합_화염저항
            player.스탯증가_합_냉기저항 -= self.스탯증가_합_냉기저항
            player.스탯증가_합_독저항 -= self.스탯증가_합_독저항
            player.스탯증가_합_전기저항 -= self.스탯증가_합_전기저항
            player.스탯증가_합_암흑저항 -= self.스탯증가_합_암흑저항
            player.스탯증가_합_신성저항 -= self.스탯증가_합_신성저항
            
            player.추가피해_합_고블린 -= self.추가피해_합_고블린
            player.추가피해_합_오크 -= self.추가피해_합_오크
            player.추가피해_합_스켈레톤 -= self.추가피해_합_스켈레톤
            player.추가피해_합_좀비 -= self.추가피해_합_좀비
            player.추가피해_합_야수 -= self.추가피해_합_야수
            player.추가피해_합_벌레 -= self.추가피해_합_벌레
            player.추가피해_합_정령 -= self.추가피해_합_정령
            player.추가피해_합_악마 -= self.추가피해_합_악마
            player.추가피해_합_천사 -= self.추가피해_합_천사
            player.추가피해_합_식물 -= self.추가피해_합_식물
            player.추가피해_합_무형 -= self.추가피해_합_무형
            player.추가피해_합_기계 -= self.추가피해_합_기계
            
            # 마부
            player.스탯증가_합_최대체력 -= self.마부_합_최대체력
            player.스탯증가_곱_최대체력 -= self.마부_곱_최대체력
            player.스탯증가_합_최대마력 -= self.마부_합_최대마력
            player.스탯증가_곱_최대마력 -= self.마부_곱_최대마력
            player.스탯증가_합_공격력 -= self.마부_합_공격력
            player.스탯증가_곱_공격력 -= self.마부_곱_공격력
            
            player.스탯증가_합_힘 -= self.마부_합_힘
            player.스탯증가_곱_힘 -= self.마부_곱_힘
            player.스탯증가_합_민첩 -= self.마부_합_민첩
            player.스탯증가_곱_민첩 -= self.마부_곱_민첩
            player.스탯증가_합_지능 -= self.마부_합_지능
            player.스탯증가_곱_지능 -= self.마부_곱_지능
            player.스탯증가_합_운 -= self.마부_합_운
            player.스탯증가_곱_운 -= self.마부_곱_운
            player.스탯증가_합_스피드 -= self.마부_합_스피드
            player.스탯증가_곱_스피드 -= self.마부_곱_스피드
            
            player.스탯증가_합_회피율 -= self.마부_합_회피율
            player.스탯증가_합_방어력 -= self.마부_합_방어력
            player.스탯증가_곱_방어력 -= self.마부_곱_방어력
            
            player.스탯증가_합_물리저항 -= self.마부_합_물리저항
            player.스탯증가_합_화염저항 -= self.마부_합_화염저항
            player.스탯증가_합_냉기저항 -= self.마부_합_냉기저항
            player.스탯증가_합_독저항 -= self.마부_합_독저항
            player.스탯증가_합_전기저항 -= self.마부_합_전기저항
            player.스탯증가_합_암흑저항 -= self.마부_합_암흑저항
            player.스탯증가_합_신성저항 -= self.마부_합_신성저항
            
            player.스탯새로고침()
            
            return True
        
        else:
            print(self.이름 + ' 해제실패')
            return False
    
    def 마부초기화(self):
        self.마부_합_최대체력 = 0
        self.마부_곱_최대체력 = 0
        self.마부_합_최대마력 = 0
        self.마부_곱_최대마력 = 0
        self.마부_합_공격력 = 0
        self.마부_곱_공격력 = 0
        self.마부_합_힘 = 0
        self.마부_곱_힘 = 0
        self.마부_합_민첩 = 0
        self.마부_곱_민첩 = 0
        self.마부_합_지능 = 0
        self.마부_곱_지능 = 0
        self.마부_합_운 = 0
        self.마부_곱_운 = 0
        self.마부_합_스피드 = 0
        self.마부_곱_스피드 = 0
        self.마부_합_회피율 = 0.0
        self.마부_합_방어력 = 0
        self.마부_곱_방어력 = 0
        self.마부_합_물리저항 = 0.0
        self.마부_합_화염저항 = 0.0
        self.마부_합_냉기저항 = 0.0
        self.마부_합_독저항 = 0.0
        self.마부_합_전기저항 = 0.0
        self.마부_합_암흑저항 = 0.0
        self.마부_합_신성저항 = 0.0

class 아이템_주문서(아이템):
    def __init__(self, 이름: str, 설명: str, 상세정보: str, 구매가: int, 판매가: int, iid:int,
                 마부_합_최대체력 = 0,
                 마부_곱_최대체력 = 0,
                 마부_합_최대마력 = 0,
                 마부_곱_최대마력 = 0,
                 마부_합_공격력 = 0,
                 마부_곱_공격력 = 0,
                 마부_합_힘 = 0,
                 마부_곱_힘 = 0,
                 마부_합_민첩 = 0,
                 마부_곱_민첩 = 0,
                 마부_합_지능 = 0,
                 마부_곱_지능 = 0,
                 마부_합_운 = 0,
                 마부_곱_운 = 0,
                 마부_합_스피드 = 0,
                 마부_곱_스피드 = 0,
                 마부_합_회피율 = 0.0,
                 마부_합_방어력 = 0,
                 마부_곱_방어력 = 0,
                 마부_합_물리저항 = 0.0,
                 마부_합_화염저항 = 0.0,
                 마부_합_냉기저항 = 0.0,
                 마부_합_독저항 = 0.0,
                 마부_합_전기저항 = 0.0,
                 마부_합_암흑저항 = 0.0,
                 마부_합_신성저항 = 0.0):
        super().__init__(이름, '주문서', 설명, 상세정보, 구매가, 판매가, iid)
        self.마부_합_최대체력 = 마부_합_최대체력
        self.마부_곱_최대체력 = 마부_곱_최대체력
        self.마부_합_최대마력 = 마부_합_최대마력
        self.마부_곱_최대마력 = 마부_곱_최대마력
        self.마부_합_공격력 = 마부_합_공격력
        self.마부_곱_공격력 = 마부_곱_공격력
        self.마부_합_힘 = 마부_합_힘
        self.마부_곱_힘 = 마부_곱_힘
        self.마부_합_민첩 = 마부_합_민첩
        self.마부_곱_민첩 = 마부_곱_민첩
        self.마부_합_지능 = 마부_합_지능
        self.마부_곱_지능 = 마부_곱_지능
        self.마부_합_운 = 마부_합_운
        self.마부_곱_운 = 마부_곱_운
        self.마부_합_스피드 = 마부_합_스피드
        self.마부_곱_스피드 = 마부_곱_스피드
        self.마부_합_회피율 = 마부_합_회피율
        self.마부_합_방어력 = 마부_합_방어력
        self.마부_곱_방어력 = 마부_곱_방어력
        self.마부_합_물리저항 = 마부_합_물리저항
        self.마부_합_화염저항 = 마부_합_화염저항
        self.마부_합_냉기저항 = 마부_합_냉기저항
        self.마부_합_독저항 = 마부_합_독저항
        self.마부_합_전기저항 = 마부_합_전기저항
        self.마부_합_암흑저항 = 마부_합_암흑저항
        self.마부_합_신성저항 = 마부_합_신성저항
        
item_list = ('단검', '사과', '바나나', '롱소드', '의식용 단검', '채찍', '천두건', '천갑옷', '천바지', '천신발', '랜턴', '아도겐 학습서', '뱀독', '독사의 눈물', '마법부여:죽음의 고통', '가죽 자켓',
             '구두', '본 아머', '이도류', '디스코 바지', '마법부여:밀림의 왕', '마법부여:강인', '마법부여:공포')
        
def item_generate(name, player, 가격배율=1):
    if name == '단검':
        return 아이템_장비('단검', '짧은 검이다.', '공격력 +3', int(10*가격배율), 4, nplayer.아이템생성위치(player), '무기', 스탯증가_합_공격력=3)
    elif name == '사과':
        return 아이템_소비('사과', '빨갛고 동그란 과일.', '체력 +5 회복.', int(3*가격배율), 2, nplayer.아이템생성위치(player), 효과_체력회복=5)
    elif name == '바나나':
        return 아이템_소비('바나나', '노랗고 기다란 과일.', '체력 +10 회복.', int(5*가격배율), 3, nplayer.아이템생성위치(player), 효과_체력회복=10)
    elif name == '롱소드':
        return 아이템_장비('롱소드', '긴 검이다.', '공격력 +5', int(15*가격배율), 5, nplayer.아이템생성위치(player), '무기', 스탯증가_합_공격력=5)
    elif name == '의식용 단검':
        return 아이템_장비('의식용 단검', '제물 의식에 사용하는 단검이다.', '공격력 +3\n최대마력 +5', int(15*가격배율), 5, nplayer.아이템생성위치(player), '무기', 스탯증가_합_공격력=3, 스탯증가_합_최대마력=5)
    elif name == '채찍':
        return 아이템_장비('채찍', '공격의 최대 속도는 음속에 달한다.', '공격력 +7\n민첩 +3', int(25*가격배율), 10, nplayer.아이템생성위치(player), '무기', 스탯증가_합_공격력=7, 스탯증가_합_민첩=3)
    elif name == '천두건':
        return 아이템_장비('천두건', '천으로 만들어진 두건.', '최대체력 +10\n방어력 +1', int(20*가격배율), 9, nplayer.아이템생성위치(player), '머리', 스탯증가_합_최대체력=10, 스탯증가_합_방어력=1)
    elif name == '천갑옷':
        return 아이템_장비('천갑옷', '천으로 만들어진 갑옷.', '최대체력 +15\n방어력 +1', int(25*가격배율), 12, nplayer.아이템생성위치(player), '상의', 스탯증가_합_최대체력=15, 스탯증가_합_방어력=1)
    elif name == '천바지':
        return 아이템_장비('천바지', '천으로 만들어진 바지.', '최대체력 +12\n방어력 +1', int(23*가격배율), 11, nplayer.아이템생성위치(player), '하의', 스탯증가_합_최대체력=12, 스탯증가_합_방어력=1)
    elif name == '천신발':
        return 아이템_장비('천신발', '천으로 만들어진 신발.', '최대체력 +8\n방어력 +1\n스피드 +1', int(20*가격배율), 10, nplayer.아이템생성위치(player), '신발', 스탯증가_합_최대체력=8, 스탯증가_합_방어력=1, 스탯증가_합_스피드=1)
    elif name == '랜턴':
        return 아이템_장비('랜턴', '어두울땐 랜턴이지 !', '최대체력 +5\n방어력 +1\n공격력 +1', int(18*가격배율), 8, nplayer.아이템생성위치(player), '보조장비', 스탯증가_합_최대체력=5, 스탯증가_합_방어력=1, 스탯증가_합_공격력=1)
    elif name == '아도겐 학습서':
        return 아이템_소비('아도겐 학습서', '아도겐의 모든 것이 담겨있는 책.', '"아도겐" 습득.', int(60*가격배율), 20, nplayer.아이템생성위치(player), 효과_스킬습득='아도겐')
    elif name == '뱀독':
        return 아이템_소비('뱀독', '독 뱀의 독이다.', '30의 데미지를 받고 방어력 +1', int(50*가격배율), 15, nplayer.아이템생성위치(player), 효과_고유스탯증가_방어력=1, 효과_피해받음=30)
    elif name == '독사의 눈물':
        return 아이템_장비('독사의 눈물', '독사의 눈물 결정체.', '최대체력 +20\n최대마력 +20', int(150*가격배율), 40, nplayer.아이템생성위치(player), '보조장비',스탯증가_합_최대체력=20, 스탯증가_합_최대마력=20)
    elif name == '마법부여:죽음의 고통':
        return 아이템_주문서('마법부여:죽음의 고통', '죽음의 고통을 느껴본적이 있는가.', '공격력 +20', int(400*가격배율), 60, nplayer.아이템생성위치(player), 마부_합_공격력=20)
    elif name == '가죽 자켓':
        return 아이템_장비('가죽 자켓', '가죽으로 만들어진 자켓.', '최대체력 +25\n방어력 +2', int(80*가격배율), 20, nplayer.아이템생성위치(player), '상의',스탯증가_합_최대체력=25, 스탯증가_합_방어력=2)
    elif name == '구두':
        return 아이템_장비('구두', '중요한 자리에 신고 가는 신발.', '최대체력 +21\n방어력 +2', int(75*가격배율), 18, nplayer.아이템생성위치(player), '신발',스탯증가_합_최대체력=21, 스탯증가_합_방어력=2)
    elif name == '본 아머':
        return 아이템_장비('본 아머', '뼈로 만들어진 갑옷.', '최대체력 +30\n방어력 +4', int(180*가격배율), 30, nplayer.아이템생성위치(player), '상의',스탯증가_합_최대체력=30, 스탯증가_합_방어력=4)
    elif name == '이도류':
        return 아이템_장비('이도류', '양손에 하나씩 든 검이다.', '공격력 +10', int(200*가격배율), 40, nplayer.아이템생성위치(player), '무기', 스탯증가_합_공격력=10, 장착시_스킬='두번베기')
    elif name == '디스코 바지':
        return 아이템_장비('디스코 바지', '춤출땐 이걸 입으세요!', '최대체력 +15\n회피율 +8%', int(40*가격배율), 10, nplayer.아이템생성위치(player), '하의', 스탯증가_합_최대체력=15, 스탯증가_합_회피율=8)
    elif name == '마법부여:밀림의 왕':
        return 아이템_주문서('마법부여:밀림의 왕', '밀림의 왕... Lion', '공격력 +15\n최대체력 +50\n방어력 +5', int(700*가격배율), 100, nplayer.아이템생성위치(player),
                       마부_합_공격력=15, 마부_합_최대체력=50, 마부_합_방어력=5)
    elif name == '마법부여:강인':
        return 아이템_주문서('마법부여:강인', '강인한자 살아남을 것이다...', '최대체력 +10%', int(450*가격배율), 70, nplayer.아이템생성위치(player), 마부_곱_최대체력=10)
    elif name == '마법부여:공포':
        return 아이템_주문서('마법부여:공포', '너의 공포가 나의 힘이다.', '공격력 +30\n암흑저항 +15%', int(700*가격배율), 100, nplayer.아이템생성위치(player), 
                       마부_합_공격력=30, 마부_합_암흑저항=15)
    else:
        return '오류'
    